Documents/ПоступлениеСХД_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПоступлениеСХД_ат</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетРесурсовСерверов_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПоступившиеСХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипСХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СХД_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыРесурсов_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыРесурсов_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>RAM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HDD_ат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Частота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Core</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданНаСервере</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запущен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическийСервер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>IPv4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>mask</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>gate</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>dns2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdmPass</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>numproc</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>autostart</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VEID</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешенаАренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПроцессора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияПамяти</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентИспользованияЖесткогоДиска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиWMI</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиVZ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СборСтатистикиZabbix</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеСХД_ат/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр УчетРесурсов_ат Приход
	Движения.УчетРесурсов_ат.Записывать = Истина;
	Для Каждого ТекСтрокаПоступившиеСХД Из ПоступившиеСХД Цикл
		Движение = Движения.УчетРесурсов_ат.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сервер = ТекСтрокаПоступившиеСХД.ТипСХД.Ссылка;
		Движение.НаименованиеРесурса = Перечисления.ТипыРесурсов_ат.HDD_ат;
		Движение.ЗначениеРесурса = ТекСтрокаПоступившиеСХД.ТипСХД.ОбщийОбъем;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
